{
    "batchcomplete": "",
    "warnings": {
        "extracts": {
            "*": "\"exlimit\" was too large for a whole article extracts request, lowered to 1."
        }
    },
    "query": {
        "normalized": [
            {
                "from": "foo",
                "to": "Foo"
            }
        ],
        "redirects": [
            {
                "from": "Foo",
                "to": "Foobar"
            }
        ],
        "pages": {
            "11178": {
                "pageid": 11178,
                "ns": 0,
                "title": "Foobar",
                "extract": "<p>The terms <b>foobar</b> (<span><span>/<span><span title=\"/ˈ/ primary stress follows\">ˈ</span><span title=\"'f' in 'find'\">f</span><span title=\"/uː/ long 'oo' in 'food'\">uː</span><span title=\"'b' in 'buy'\">b</span><span title=\"/ɑːr/ 'ar' in 'far'\">ɑːr</span></span>/</span></span>), or <b>foo</b> and others are used as placeholder names (also referred to as metasyntactic variables) in computer programming or computer-related documentation. They have been used to name entities such as variables, functions, and commands whose exact identity is unimportant and serve only to demonstrate a concept.</p>\n<p></p>\n<h2><span id=\"History_and_etymology\">History and etymology</span></h2>\n\n<p>The etymology of <i>foo</i> is obscure. Its use in connection with <i>bar</i> is generally traced to the World War II military slang FUBAR, later bowdlerised to <i>foobar</i>. The word <i>foo</i> on its own was used earlier. Between about 1930 and 1952 it appeared in the comic <i>Smokey Stover</i> by Bill Holman, who stated that he used the word due to having seen it on the bottom of a jade Chinese figurine in Chinatown, San Francisco, purportedly signifying \"good luck\". This may be related to the Chinese word <i>fu</i> (\"福\", sometimes transliterated <i>foo</i>), which can mean <i>happiness</i>.</p>\n<p>The first known use of the terms in print in a programming context appears in a 1965 edition of MIT's <i>Tech Engineering News</i>. <i>Foobar</i> may have come about as a result of the pre-existing \"Foo\" being conjoined with \"bar\" an addition borrowed from the military's FUBAR. The use of <i>foo</i> in a programming context is generally credited to the Tech Model Railroad Club (TMRC) of MIT from circa 1960. In the complex model system, there were scram switches located at numerous places around the room that could be thrown if something undesirable was about to occur, such as a train going full-bore at an obstruction. Another feature of the system was a digital clock on the dispatch board. When someone hit a scram switch, the clock stopped and the display was replaced with the word \"FOO\"; at TMRC the scram switches are, therefore, called \"Foo switches\". Because of this, an entry in the 1959 <i>Dictionary of the TMRC Language</i> went something like this: \"FOO: The first syllable of the misquoted sacred chant phrase 'foo mane padme hum.' Our first obligation is to keep the foo counters turning.\" One book describing the MIT train room describes two buttons by the door: labeled \"foo\" and \"bar\". These were general purpose buttons and were often re-purposed for whatever fun idea the MIT hackers had at the time, hence the adoption of foo and bar as general purpose variable names. An entry in the <i>Abridged Dictionary of the TMRC Language</i> states:</p>\n<blockquote class=\"templatequote\">\n<p>Multiflush: stop-all-trains-button. Next best thing to the red door button. Also called FOO. Displays \"FOO\" on the clock when used.</p>\n</blockquote>\n<p>The term <i>foobar</i> was propagated through computer science circles in the 1960s and early 1970s by system manuals from Digital Equipment Corporation. <i>Foobar</i> was also used as a variable name in the Fortran code of <i>Colossal Cave Adventure</i> (1977 Crowther and Woods version). The variable FOOBAR was used to contain the player's progress in saying the magic phrase \"Fee Fie Foe Foo\".</p>\n<h2><span id=\"Example_use_in_code\">Example use in code</span></h2>\n<p>In this Hello World code sample, foo and bar are used to illustrate string concatenation:</p>\n\n<h2><span id=\"Examples_in_language\">Examples in language</span></h2>\n<ul><li>Foo Camp is an annual hacker convention.</li>\n<li>BarCamp, an international network of user generated conferences</li>\n<li>During the <i>United States v. Microsoft Corp.</i> trial, some evidence was presented that Microsoft had tried to use the Web Services Interoperability organization as a means to stifle competition, including e-mails in which top executives including Bill Gates referred to the WS-I using the codename \"foo\".</li>\n<li>foobar2000 is an audio player.</li>\n<li>Google uses a web tool called foo.bar to recruit new employees.</li>\n<li>Foo Fighters is an American rock band named after the foo fighters, unidentified flying objects reported by World War II pilots.</li>\n<li>Stanley Black &amp; Decker has registered the trademark <i>fubar</i>, used as branding for a type of crowbar.</li>\n</ul><h2><span id=\"See_also\">See also</span></h2>\n\n<ul><li>xyzzy</li>\n<li>Category:Variable (computer science)</li>\n</ul>\n<h2><span id=\"References\">References</span></h2>\n\n<h2><span id=\"External_links\">External links</span></h2>\n<ul><li>The Jargon File entry on \"foobar\", catb.org</li>\n<li>RFC 1639 – FTP Operation Over Big Address Records (FOOBAR)</li>\n</ul>"
            }
        }
    }
}